<a target="_blank" href="https://colab.research.google.com/github/peterhgruber/python-intro-colab/blob/main/05Python_Dataframes.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Introduction to Python
### Main concepts of Python – Part 04
Peter Gruber (peter.gruber@usi.ch), 2024-04-01

* Pandas DataFrames

##  Pandas
- Powerful library for ...
    - Managing data in dataframes
    - Modifying data structures (merge, subset)
    - Performing basic data analysis
    - Simple plotting
- Gold standard for data analysis in Python

## 1 Setup Pandas

In [ ]:
# Install pandas: Uncomment the line below and run it *once*
# !pip install pandas

In [3]:
# Importing the library 
# "... as pd" creates a shortcut for later use ... everybody does it
import pandas as pd

## 2 Load data

- Advertising click prediction, https://www.kaggle.com/jahnveenarang/cvdcvd-vd

In [10]:
# Load dataframe
# On Colab: upload file first
df = pd.read_pickle('Social_Network_Ads.pkl')

## 3 Inspect data

In [5]:
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [6]:
# First `n` entries (rows) of the dataframe
df.head(4)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0

In [7]:
# Last `n` entries (rows) of the dataframe
df.tail(3)

      User ID  Gender  Age  EstimatedSalary  Purchased
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

In [8]:
type(df)

pandas.core.frame.DataFrame

### 4 Subsetting

In [9]:
# Select a column by name
df['Age']

0      19
1      35
2      26
3      27
4      19
       ..
395    46
396    51
397    50
398    36
399    49
Name: Age, Length: 400, dtype: int64

In [ ]:
# Select a column by index (rarely used)
df.iloc[:,2]

In [ ]:
# Select multiple columns
df[ ['Gender', 'EstimatedSalary'] ]

In [ ]:
# Select a row by index
df.iloc[1,:]       #  (can leave out ",:" here)

In [ ]:
# Select multiple rows with colon
df.iloc[10:15,:]         # <-- upper index is "one more" (can leave out ",:" here)

In [ ]:
# Select multiple rows
df.iloc[[1, 67, 96],:]

In [ ]:
# Select individual element (rarely used)
# Salary of row 5
df.iloc[5,3]

### 5 Functions and summaries
* No need for complicated list comprehensions here
* Use `numpy` to apply function to entire vector
* Use `df.xxx()` methods to summarize data

In [12]:
import numpy
numpy.log(df['EstimatedSalary'])

0       9.852194
1       9.903488
2      10.668955
3      10.950807
4      11.238489
         ...
395    10.621327
396    10.043249
397     9.903488
398    10.404263
399    10.491274
Name: EstimatedSalary, Length: 400, dtype: float64

In [13]:
# Average salary
df['EstimatedSalary'].mean()

69742.5

In [14]:
# Unique values in a column. 
# Useful when analysing categories such as products, stocks, countries, etc
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [15]:
df['Age'] <= 40

0       True
1       True
2       True
3       True
4       True
       ...
395    False
396    False
397    False
398     True
399    False
Name: Age, Length: 400, dtype: bool

In [16]:
# Count number of young customers
sum(df['Age'] <= 40)

253

In [17]:
# Fraction of young customers
(df['Age'] <= 40).mean()

0.6325

### *5.1 Multiple and complementary conditons .. not that easy

- Pandas is an abstraction that simplifies data operations, but...
    - Has different Object Types: Series and DataFrame
    - Requires specific syntax (`~`, `&`,  `|`) instead of  `not`, `and`, `or`.

In [18]:
# A "DataFrame" object
print(type(df))

# Single column is seen as "Series" object
print(type(df['Age']))

# Multiple columns are seen as "DataFrame" object
print(type(df[ ['Age', 'Purchased'] ]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [19]:
# Complementary conditon, "~" for "not"
~(df['Age'] <=40)

0      False
1      False
2      False
3      False
4      False
       ...
395     True
396     True
397     True
398    False
399     True
Name: Age, Length: 400, dtype: bool

In [20]:
# Dual conditions, "&" for "and"
# Users with age below 40 and salary above 50'000
(df['Age']<=40) & (df['EstimatedSalary']>=50000)

0      False
1      False
2      False
3       True
4       True
       ...
395    False
396    False
397    False
398    False
399    False
Length: 400, dtype: bool

In [21]:
# "|" for "or"
# Users with age either under 30 or above 45
(df['Age']<=30) | (df['Age']>=45)

0       True
1      False
2       True
3       True
4       True
       ...
395     True
396     True
397     True
398    False
399     True
Name: Age, Length: 400, dtype: bool

In [22]:
# Fraction of people above 40
( ~(df['Age']<=40) ).mean()

0.3675

In [23]:
# Tertia non datur
( ~(df['Age']<=40) ).mean() + (df['Age']<=40).mean()

1.0

### 6 Subsetting by condition

* Daily bread of data scientist. Analyze ...
    * "all older participants"
    * "all older male participants"
    * "all older male participants with high income"
* **Syntax:** `df[<condition> ]`
* **Syntax:** `df['<column>'][<condition> ]`

In [ ]:
# Recap
df['Age']>=30

In [ ]:
# Select rows for which <condtion> is True
df[ df['Age']>=30 ]

In [ ]:
# Subset just one column
df['EstimatedSalary'][ df['Age']>=30 ]

**Notice:** Length is now shorter

In [ ]:
# Statistics of a subset
# Average salary of people aged 30 or more.
df['EstimatedSalary'][ df['Age']>=30 ].mean()

#### 6.1 Multiple conditions
* Require extra `()` around condition
* Still `&` and `|` operators
* **Syntax** `df['<column>'][ (<condition1>) & (<condition2>) ]`

In [ ]:
df['EstimatedSalary'][ (df['Age']>=30) & (df['Gender']=="Male") ].mean()

In [ ]:
df['EstimatedSalary'][ (df['Age']>=30) & (df['Gender']=="Male") & 
                       (df['EstimatedSalary']>40000) ].mean()

**Exercise:** Answer these questions ...
* Is the average salary for male or female participants higher?
* What is the average salary

In [ ]:
df['EstimatedSalary'][ df['Gender']=="Male" ].mean()

In [ ]:
df['EstimatedSalary'][ ~(df['Gender']=="Male") ].mean()

In [ ]:
df['EstimatedSalary'].mean()

## 7 Modify dataframe structure
- Add new column: simply assign values
- Delete a column: `df.drop('<column>')`

In [ ]:
retirement_age = 60
df['YearsToRetirement'] = retirement_age - df['Age']
df

In [ ]:
# Remove column
df.drop(columns='YearsToRetirement', inplace=True)

In [ ]:
df

**Exercise:** Add a column named `SalaryUSD` that convertes the salary from CHF to USD. The exchange rate is 1.15 USD/CHF.

In [ ]:
# code goes here
df['SalaryUSD'] = df['EstimatedSalary']*1.15

In [ ]:
df